Tasks/БюджетнаяЗадача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Task>
		<Properties>
			<Name>БюджетнаяЗадача</Name>
			<Addressing>InformationRegister.ИсполнителиЗадач</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МодельБюджетирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапПодготовкиБюджетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДействийЭтаповПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаДействия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата и время фактического выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Comment>Плановый срок исполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Comment>Описание постановки задачи для исполнителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.БюджетнаяЗадача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИсходныйЭтапПодготовкиБюджетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор бизнес-процесса, который сформировал задачу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКонтрольныхОтчетов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапПодготовкиБюджетовОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцессПодготовкиБюджетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроцессПодготовкиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УтверждаемыеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПланЗакупок</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланПродаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЭкземплярБюджета</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланСборкиРазборки</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланПроизводства</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПодготовкиБюджетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыПодготовкиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПланЗакупок</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланПродаж</v8:Type>
								<v8:Type>cfg:DocumentRef.УстановкаЗначенийНефинансовыхПоказателей</v8:Type>
								<v8:Type>cfg:DocumentRef.ЭкземплярБюджета</v8:Type>
								<v8:Type>cfg:DocumentRef.ЛимитыРасходаДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланСборкиРазборки</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Tasks/БюджетнаяЗадача/Forms/ФормированиеСвязаннойЗадачи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ВыбиратьИсполнителя = Параметры.ВыбиратьИсполнителя;
	ВыбиратьЭтапПодготовкиБюджетов = Параметры.ВыбиратьЭтапПодготовкиБюджетов;
	МодельБюджетирования = Параметры.МодельБюджетирования;
	
	Если Параметры.ФормированиеНесколькихЗадач Тогда
		ЗаголовокФормы = НСтр("ru = 'Формирование связанных задач'");
		ЗаголовокСформироватьЗадачу = НСтр("ru = 'Сформировать задачи'");
		ЗаголовокНеФормироватьЗадачу = НСтр("ru = 'Не формировать задачи'");
		ЗаголовокГруппаВыборШагаПроцесса = НСтр("ru = 'Создать задачи в рамках'")
	Иначе
		ЗаголовокФормы = НСтр("ru = 'Формирование связанной задачи'");
		ЗаголовокСформироватьЗадачу = НСтр("ru = 'Сформировать задачу'");
		ЗаголовокНеФормироватьЗадачу = НСтр("ru = 'Не формировать задачу'");
		ЗаголовокГруппаВыборШагаПроцесса = НСтр("ru = 'Создать задачу в рамках'")
	КонецЕсли;
	
	ЭтаФорма.Заголовок = ?(Не ПустаяСтрока(Параметры.ЗаголовокФормы), Параметры.ЗаголовокФормы, ЗаголовокФормы);
	Элементы.СформироватьЗадачу.Заголовок = ЗаголовокСформироватьЗадачу;
	Элементы.НеФормироватьЗадачу.Заголовок = ЗаголовокНеФормироватьЗадачу;
	Элементы.ГруппаВыборШагаПроцесса.Заголовок = ЗаголовокГруппаВыборШагаПроцесса;
	
	Элементы.ГруппаВыборШагаПроцесса.Видимость = ВыбиратьЭтапПодготовкиБюджетов;
	Элементы.Исполнитель.Видимость = ВыбиратьИсполнителя;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(СрокИсполнения) И НачалоДня(СрокИсполнения) < НачалоДня(ТекущаяДата()) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Срок исполнения задачи не может быть меньше текущей даты'"), , , "СрокИсполнения", Отказ);
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ВариантВыбораЭтапПодготовкиБюджетов = 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЭтапПодготовкиБюджетов");
	КонецЕсли;
	
	Если Не ВыбиратьИсполнителя Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Исполнитель");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЭтапПодготовкиБюджетовТекущийПриИзменении(Элемент)
	
	ЭтапПодготовкиБюджетов = Неопределено;
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПодготовкиБюджетовВыбранныйПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьЗадачу(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура("Наименование, СрокИсполнения, ОписаниеЗадачи");
	Если ВыбиратьИсполнителя Тогда
		Результат.Вставить("Исполнитель");
	КонецЕсли;
	Если ВариантВыбораЭтапПодготовкиБюджетов Тогда
		Результат.Вставить("ЭтапПодготовкиБюджетов");
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура НеФормироватьЗадачу(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ЭтапПодготовкиБюджетов.Доступность = (ВариантВыбораЭтапПодготовкиБюджетов = 1);
	Элементы.ЭтапПодготовкиБюджетов.АвтоОтметкаНезаполненного = (ВариантВыбораЭтапПодготовкиБюджетов = 1);
	
КонецПроцедуры


#КонецОбласти
